somsubhojit1988/msp430_record_filter/src/audio_capture.c
/*
 * audio_capture.c
 *
 *  Created on: Jun 20, 2018
 *      Author: subhojit
 */
#include <driverlib.h>


#include "audio_capture.h"
#include "globals.h"

//DSPLIB_DATA(adc_buffer1, 4)
_q15 adc_buffer1[SIGNAL_LENGTH];

//DSPLIB_DATA(adc_buffer2, 4)
_q15 adc_buffer2[SIGNAL_LENGTH];

static DMA_initParam dma0Config;
static DMA_initParam dma1Config;

void Audio_setup_recording() {

    audConfig.bufferlen = SIGNAL_LENGTH;
    audConfig.samplingFrequency = SAMPLING_FREQ;

    Timer_A_initUpModeParam upConfig =
    {
     TIMER_A_CLOCKSOURCE_SMCLK,
     TIMER_A_CLOCKSOURCE_DIVIDER_1,
     (__SYSTEM_FREQUENCY_MHZ__ / audConfig.samplingFrequency) - 1,
     TIMER_A_TAIE_INTERRUPT_DISABLE,
     TIMER_A_CCIE_CCR0_INTERRUPT_DISABLE,
     TIMER_A_DO_CLEAR,
     false
    };

    Timer_A_initCompareModeParam compareConfig =
    {
     TIMER_A_CAPTURECOMPARE_REGISTER_1,
     TIMER_A_CAPTURECOMPARE_INTERRUPT_DISABLE,
     TIMER_A_OUTPUTMODE_TOGGLE_RESET,
     ((__SYSTEM_FREQUENCY_MHZ__ / audConfig.samplingFrequency) / 2) - 1
    };

    // Turn on mic power full drive strength and enable mic input pin to ADC
    MIC_POWER_PORT_OUT |= MIC_POWER_PIN; // P6OUT |=  BIT2 (0x0004)
    MIC_POWER_PORT_DIR |= MIC_POWER_PIN; // P6DIR |=  BIT2 (0x0004)


    AUDIO_PORT_SEL0 |= MIC_INPUT_PIN;    // P1SEL0 |= BIT3 (0x0008)
    AUDIO_PORT_SEL1 |= MIC_INPUT_PIN;    // P1SEL1 |= BIT3 (0x0008)

    // For safety, protect RMW Cpu instructions
    DMA_disableTransferDuringReadModifyWrite();

    // Initialize the DMA. Using DMA channel 1.
    dma0Config.channelSelect = DMA_CHANNEL_1;
    dma0Config.transferModeSelect = DMA_TRANSFER_SINGLE;
    dma0Config.transferSize = SIGNAL_LENGTH;
    dma0Config.triggerSourceSelect = DMA_TRIGGERSOURCE_26;
    dma0Config.transferUnitSelect = DMA_SIZE_SRCWORD_DSTWORD;
    dma0Config.triggerTypeSelect = DMA_TRIGGER_RISINGEDGE;


    // Initialize the DMA. Using DMA channel 2.
    dma1Config.channelSelect = DMA_CHANNEL_2;
    dma1Config.transferModeSelect = DMA_TRANSFER_SINGLE;
    dma1Config.transferSize = SIGNAL_LENGTH;
    dma1Config.triggerSourceSelect = DMA_TRIGGERSOURCE_26;
    dma1Config.transferUnitSelect = DMA_SIZE_SRCWORD_DSTWORD;
    dma1Config.triggerTypeSelect = DMA_TRIGGER_RISINGEDGE;

    DMA_init(&dma0Config);
    DMA_init(&dma1Config);

    DMA_setSrcAddress(DMA_CHANNEL_1,
                      (uint32_t) &ADC12MEM0,
                      DMA_DIRECTION_UNCHANGED);

    DMA_setDstAddress(DMA_CHANNEL_1,
                      (uint32_t) (&adc_buffer1),
                      DMA_DIRECTION_INCREMENT);

    DMA_setSrcAddress(DMA_CHANNEL_2,
                      (uint32_t) &ADC12MEM0,
                      DMA_DIRECTION_UNCHANGED);

    DMA_setDstAddress(DMA_CHANNEL_2,
                      (uint32_t) (&adc_buffer2),
                      DMA_DIRECTION_INCREMENT);

    // Configure ADC
    ADC12CTL0 &= ~ADC12ENC;           // Disable conversions to configure ADC12
    // Turn on ADC, sample 32 clock cycles =~ 2us
    ADC12CTL0 = ADC12ON + ADC12SHT0_3;

    // Use sample timer, rpt single chan 0, use MODOSC, TA0 timer channel 1
    ADC12CTL1 = ADC12SHP + ADC12CONSEQ_2 + ADC12SHS_1;

    // Mic input to ADC, (AVCC/AVSS ref), sequence end bit set
    ADC12MCTL0 = MIC_INPUT_CHAN | ADC12EOS;

    //    ADC12IER0 |= ADC12IE0;
    //    ADC12IER0 = ADC12IER0|ADC12IE0_1; //enabling interrupt for mem0

    // Initialize Timer_A channel 1 to be used as ADC12 trigger
    // Initialize TACCR0 (period register) 8MHz/20kHz = 400
    // Simple counter with no interrupt. 0...400 = 400 counts/sample
    Timer_A_initUpMode(TIMER_A0_BASE, &upConfig);

    // Initialize TA0CCR1 to generate trigger clock output, reset/set mode
    Timer_A_initCompareMode(TIMER_A0_BASE, &compareConfig);

    // Enable ADC to convert when a TA0 edge is generated
    ADC12CTL0 |= ADC12ENC;

    // Delay for the microphone to settle
    __delay_cycles(10000);
}

void Audio_start_recording( ){
       // Enable DMA channel 1 interrupt
       DMA_enableInterrupt(DMA_CHANNEL_1);

       // Enable the DMA0 to start receiving triggers when ADC sample available
       DMA_enableTransfers(DMA_CHANNEL_1);

       // Start TA0 timer to begin audio data collection
       Timer_A_clear(TIMER_A0_BASE);
       Timer_A_startCounter(TIMER_A0_BASE, TIMER_A_UP_MODE);
}

void Audio_stop_recording(){
    Timer_A_stop(TIMER_A0_BASE);

    ADC12_B_disableConversions(ADC12_B_BASE, ADC12_B_COMPLETECONVERSION);

    // Disable DMA channel and interrupt
    DMA_disableTransfers(DMA_CHANNEL_1);
    DMA_disableInterrupt(DMA_CHANNEL_1);

    // Disable DMA channel and interrupt
    DMA_disableTransfers(DMA_CHANNEL_2);
    DMA_disableInterrupt(DMA_CHANNEL_2);
}

void Audio_shutdown_recording() {
    // Turn off preamp power
    MIC_POWER_PORT_OUT &= ~MIC_POWER_PIN;

    // Disable the ADC
    ADC12_B_disable(ADC12_B_BASE);
}

_q15* Audio_get_filled_buffer(){
    return audConfig.filledBuffer;
}
